Autodesk.Revit.DB.Structure.StructuralConnectionBaseUtil.UseDynamicProfiles
Returns:
Returns true to use StructuralSection interface for connections computations.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionBaseUtil
This class provides utilities for structural connections.
Since:
2017